export const questionsDataOld = [
    // بخش 1: استعداد موسیقیایی
   
  
    // بخش جدید: شیوه تعامل با دنیا (برون‌گرایی / درون‌گرایی)
    {
      section: 'شیوه تعامل با دنیا: برون‌گرایی (E) / درون‌گرایی (I)',
      questions: [
        'آیا ترجیح می‌دهید وقت بیشتری با دوستان خود بگذرانید؟',
        'آیا در رویدادهای گروهی شرکت کردن برای شما لذت‌بخش است؟',
        'آیا ترجیح می‌دهید فعالیت‌های خود را به تنهایی انجام دهید؟',
        'آیا از صحبت کردن با افراد جدید لذت می‌برید؟',
        'آیا معمولاً در محیط‌های شلوغ احساس راحتی می‌کنید؟',
        'آیا وقتی در جمع هستید انرژی بیشتری می‌گیرید؟',
        'آیا به جای تعاملات اجتماعی، وقت‌گذرانی در خلوت را ترجیح می‌دهید؟',
        'آیا وقتی افراد زیادی دور و بر شما هستند، هیجان‌زده می‌شوید؟',
        'آیا بیشترین خلاقیت خود را در لحظات تنهایی می‌یابید؟',
        'آیا ترجیح می‌دهید تصمیم‌گیری‌های گروهی انجام دهید؟',
        'آیا معمولاً بیشترین زمان خود را صرف روابط اجتماعی می‌کنید؟',
        'آیا به حضور در میهمانی‌ها و جمع‌ها علاقه‌مندید؟',
        'آیا شما معمولاً صحبت‌کننده اصلی در یک گروه هستید؟',
        'آیا معاشرت با دوستان برای شما مهم‌تر از تنهایی است؟',
        'آیا ارتباط برقرار کردن با افراد جدید برای شما آسان است؟',
        'آیا وقتی مجبورید زیاد با دیگران تعامل کنید، احساس خستگی می‌کنید؟',
        'آیا هنگام انتخاب برنامه‌ها، دوست دارید گروهی تصمیم‌گیری کنید؟',
        'آیا وقتی تنهایی وقت می‌گذرانید، احساس آرامش بیشتری دارید؟',
        'آیا ترجیح می‌دهید ایده‌های خود را در بحث‌های گروهی مطرح کنید؟',
        'آیا معمولاً از سکوت و خلوت لذت می‌برید؟',
        'آیا معمولاً وقت خود را در فضای عمومی می‌گذرانید؟',
        'آیا وقتی تنها هستید، انرژی بیشتری دارید؟',
        'آیا گفت‌وگوهای طولانی در جمع‌های بزرگ را ترجیح می‌دهید؟',
        'آیا برای به اشتراک‌گذاری تجربیات خود تمایل زیادی دارید؟',
        'آیا ترجیح می‌دهید بیشتر روی افکار و علایق شخصی خود متمرکز باشید؟',
      ],
    },
];
